In [9]:
import pandas as pd
import numpy as np

In [25]:
dict1={'Names':['Aravind','samar',np.nan,'siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Aravind', 'samar', nan, 'siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [47]:
d1=pd.DataFrame(dict1,index=[1,2,3,4])

In [27]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [24]:
dict2={'Names':['Aravind','samar',None,'siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',None]}
dict2

{'Names': ['Aravind', 'samar', None, 'siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', None]}

In [23]:
d2=pd.DataFrame(dict2,index=[1,2,3,4])

In [28]:
d2.dtypes

Names     object
Age      float64
City      object
dtype: object

In [29]:
d1.isnull()

   Names    Age   City
1  False   True  False
2  False  False  False
3   True  False  False
4  False  False   True

In [32]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [34]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan: means not a number this is applicable for numerical columns only

- Generally data has some empty rows

- It is a data problem

- If you read that kind of data you will see Null

- We need to understand it is a data corrupted or really a Null values are there

**Method-1**

**Fill with some random values**

**Method name**:fill na

In [35]:
d1.fillna(40)

     Names   Age     City
1  Aravind  40.0      Hyd
2    samar  21.0      Blr
3       40  32.0  Chennai
4     siri  43.0       40

**Method-2**

- we can fill the values w.r.t columns also

In [49]:
d1['Age'].fillna(20,inplace=True)

In [50]:
d1

     Names   Age     City
1  Aravind  20.0      Hyd
2    samar  21.0      Blr
3      NaN  32.0  Chennai
4     siri  43.0      NaN

In [51]:
dict1={'Names':['Aravind','samar',np.nan,'siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Aravind', 'samar', nan, 'siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [52]:
d1=pd.DataFrame(dict1,index=[1,2,3,4])

In [53]:
d1

     Names   Age     City
1  Aravind   NaN      Hyd
2    samar  21.0      Blr
3      NaN  32.0  Chennai
4     siri  43.0      NaN

**Method-3**

- bfill

- ffill

- pad

- backfill

In [54]:
d1.fillna(method='bfill')

C:\Users\Vinay\AppData\Local\Temp\ipykernel_11024\1914124427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

     Names   Age     City
1  Aravind  21.0      Hyd
2    samar  21.0      Blr
3     siri  32.0  Chennai
4     siri  43.0      NaN

In [55]:
d1.fillna(method='ffill')

C:\Users\Vinay\AppData\Local\Temp\ipykernel_11024\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

     Names   Age     City
1  Aravind   NaN      Hyd
2    samar  21.0      Blr
3    samar  32.0  Chennai
4     siri  43.0  Chennai

In [56]:
d1.fillna(method='pad')

C:\Users\Vinay\AppData\Local\Temp\ipykernel_11024\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

     Names   Age     City
1  Aravind   NaN      Hyd
2    samar  21.0      Blr
3    samar  32.0  Chennai
4     siri  43.0  Chennai

In [58]:
d1.fillna(method='backfill')

C:\Users\Vinay\AppData\Local\Temp\ipykernel_11024\907203477.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill')

     Names   Age     City
1  Aravind  21.0      Hyd
2    samar  21.0      Blr
3     siri  32.0  Chennai
4     siri  43.0      NaN

In [60]:
d1.fillna(method='backfill',axis=1)

#axis=1 means columns

#so it replace next columns values

C:\Users\Vinay\AppData\Local\Temp\ipykernel_11024\3144217331.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill',axis=1)

     Names   Age     City
1  Aravind   Hyd      Hyd
2    samar  21.0      Blr
3     32.0  32.0  Chennai
4     siri  43.0      NaN

- backfill and bifill fills with next value

- pad and ffill fills with previous value

- but it will change based on axis

**Method-4**

- mean
  - Numerical values can fill with mean value
  - but mean affect by outliers
  - if we dont have outliers it is best one
 
- median
  - numerical values can fill with median value
  - we know that median value does not affect with outliers
  - so if outliers are there we can go with median

- mode
  - mode is useful for categorical data

In [61]:
dict1={'Names':['Aravind','samar',np.nan,'siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Aravind', 'samar', nan, 'siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [62]:
d1=pd.DataFrame(dict1,index=[1,2,3,4])

In [63]:
d1

     Names   Age     City
1  Aravind   NaN      Hyd
2    samar  21.0      Blr
3      NaN  32.0  Chennai
4     siri  43.0      NaN

In [65]:
# we already know we can fill with some values based on specific column using 

# d1.fillna(<random_number>)

#d1 represents all the columns

age_mean=d1['Age'].mean()

d1['Age'].fillna(age_mean)

1    32.0
2    21.0
3    32.0
4    43.0
Name: Age, dtype: float64

In [68]:
age_median=d1['Age'].median()

d1['Age'].fillna(age_median)

1    32.0
2    21.0
3    32.0
4    43.0
Name: Age, dtype: float64

In [69]:
age_mode=d1['Age'].median()

d1['Age'].fillna(age_mode)

1    32.0
2    21.0
3    32.0
4    43.0
Name: Age, dtype: float64

**Method-5**

**KNN imputer**

- KNN: K Nearest Neighbour

- K is a hyper parameter means user can choose the value of K

- it is distance metric: **Euclidian distance**

- KNN impute will take the mean of the neighbour value

- The neighbour value can provided by using value=k

- it is under sklearn package

- Under sklearn we have Imputer method

- under Imputer method we have Knnlmputer

- Applicable only for Numerical data

In [74]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])